app/controllers/playlists_controller.rb

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @playlist = Playlist.find(params[:id])

INSERT INTO "playlists" ("name", "number_of_votes") VALUES (?, ?)  [["name", "Lista de Reproduccion"], ["number_of_votes", "50"]]
---
  def create
    @playlist = Playlist.new(playlist_params)
    if @playlist.save