app/controllers/tracks_controller.rb

INSERT INTO "tracks" ("title", "album", "artist", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "A dormir junticos"], ["album", "El sol"], ["artist", "Vicente Fernandez"], ["created_at", "2016-03-22 17:18:21.970841"], ["updated_at", "2016-03-22 17:18:21.970841"]]
---
  def create
    @track = Track.new(track_params)

    respond_to do |format|
      if @track.save

UPDATE "tracks" SET "artist" = ?, "updated_at" = ? WHERE "tracks"."id" = ?  [["artist", "Alfredo Bravo"], ["updated_at", "2016-03-22 22:14:58.152979"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @track.update(track_params)